[
    {
        "title": "Highly Dependable Blockchain",
        "type": "technical",
        "description": "Developed a secure blockchain using the IBFT consensus algorithm, ensuring integrity and resilience against Byzantine faults.",
        "coverImage": "block_maven.webp",
        "languages": [
            "Java",
            "Python",
            "JUnit5",
            "Maven"
        ],
        "task": "Implement a secure and dependable blockchain utilizing the IBFT consensus algorithm to handle transactions securely, resist Byzantine faults, and maintain authenticity and integrity.",
        "solution": "Continued work on an existing codebase to implement a secure blockchain based on the IBFT consensus algorithm. Developed tests using JUnit5 to ensure system dependability, and refined the IBFT algorithm based on test outputs. \n\nImplemented the client-side transaction processing and ensured protection against replay attacks, double spending, and Byzantine node collaboration. Implemented digital signature-based authentication to uphold message integrity and authenticity. \n\nAchieved industry-standard execution of blocks and dependability guarantees such as security, validity, liveness, and protection against Byzantine behavior.",
        "time": "Spring 2024",
        "images": [
            "block_byzantine_quorum.webp",
            "block_client.webp",
            "block_blockchain.webp"
        ],
        "image_description": [
            "Quorum size used to handle Byzantine faults",
            "CLI for Client Transactions",
            "Illustration of block structure in blockchain"
        ],
        "link": "https://github.com/tildeeine/highly_dependable_blockchain"
    },
    {
        "title": "Ambient Home Security System",
        "type": "technical",
        "description": "Developed an ambient system prototype to monitor and ensure the safety of home appliances for at-risk individuals living alone.",
        "coverImage": "ambint_circuit.webp",
        "languages": [
            "Python",
            "MicroPython",
            "C++",
            "JavaScript",
            "HTML",
            "CSS"
        ],
        "task": "Design any choice of ambient system using using RPis and Arduinos. Design a prototype ambient system to assist at-risk individuals in living independently by monitoring potentially hazardous home appliances.",
        "solution": "My group wanted to do a project that could allow at-risk individuals to stay at home for longer instead of moving to a care home, by monitoring potentially hazardous home appliances using Raspberry Pi, Arduino, and Nicla Vision. \n\nThe system features a web interface created with Flask and React, which offers real-time status updates like current temperature readings and time since door was last opened, as well as real-time photos from the Nicla Vision camera component. On dangerous readings, the option to activate a kill switch for the oven appears, which allows the user to remotely turn off the oven. This feature can be used by the resident of the house, or by caretakers who would also have access to the platform to monitor the resident's safety. \n\nThe system is designed to be user-friendly and accessible, with a simple and intuitive interface that provides clear information and control options. The system is also designed to be scalable, allowing for additional sensors and appliances to be added in the future to further enhance safety and monitoring capabilities.",
        "time": "Spring 2024",
        "images": [
            "ambint_diagram.webp",
            "ambint_dashboard.webp",
            "ambint_modal.webp"
        ],
        "image_description": [
            "Deployment diagram of security system",
            "The dashboard for monitoring home appliances, with door alert active",
            "The modal for more detailed information and control of the system"
        ],
        "link": "https://github.com/tildeeine/ambient_home_security"
    },
    {
        "title": "Secure Network for Health Records",
        "type": "technical",
        "description": "Implemented a secure network for signing and accessing electronic health records using firewalls, authentication, and cryptography.",
        "coverImage": "network_infrastructure.webp",
        "languages": [
            "C++",
            "C#/.NET",
            "MySQL",
            "Vagrant"
        ],
        "task": "Create a secure system for managing electronic health records, ensuring confidentiality, integrity, and authenticity of data.",
        "solution": "Designed and implemented a secure network for managing electronic health records, ensuring the confidentiality, integrity, and authenticity of patient data. Implemented a secure server-client architecture using C++ and C#/.NET, with MySQL for data storage. Utilized firewalls, authentication mechanisms, and cryptography to protect data in transit and at rest. Implemented digital signatures for data integrity and authenticity, as well as an authentication server handling access, ensuring that patient data is not tampered with and that only authorized users can access it. \n\nThe system is designed to be scalable and secure, with a focus on protecting patient data and ensuring that only authorized users can access it. It also supports an emergency override option available to physicians, but will be alerted to the patient if used. The use of digital signatures and encryption ensures that patient data is protected from unauthorized access and tampering, while the use of firewalls and authentication mechanisms helps to prevent unauthorized access to the system. The system is designed to be user-friendly and accessible, and users interact with it through a simple CLI",
        "time": "Winter 2023/2024",
        "images": [
            "network_infrastructure.webp",
            "network_server_encryption.webp",
            "network_doctor_data.webp"
        ],
        "image_description": [
            "Diagram overview of network infrastructure",
            "Patient data encryption on the server",
            "Doctor accessing patient data with digital signature"
        ],
        "link": "https://github.com/tildeeine/secure_network_for_health_records"
    },
    {
        "title": "IaC To-Do List Application",
        "type": "technical",
        "description": "Deployed a scalable To-Do List application using Terraform, Ansible, and Vagrant for infrastructure-as-code on Google Cloud Platform.",
        "coverImage": "iac_architecture.webp",
        "languages": [
            "JavaScript",
            "Terraform",
            "Ansible",
            "Vagrant"
        ],
        "task": "Create a scalable microservice-based to-do list application with infrastructure managed through Infrastructure as Code (IaC) and robust monitoring.",
        "solution": "Designed and implemented a microservice-based to-do list application using Express.js for the backend and Svelte for the frontend. The project focused on managing IT infrastructures through Infrastructure as Code (IaC). \n\nDeployment to Google Cloud Platform (GCP) was automated using Terraform, Ansible, and Vagrant, ensuring a scalable and efficient deployment process. We used a MongoDB database replica set for persistent storage, providing reliability and redundancy, and a Grafana dashboard for monitoring system health and performance. \n\nThe services implemented include adding/removing and checking/unchecking items on the to-do list, providing a simple to-do list application as the main focus was on the management and deployment of the network infrastructure. ",
        "time": "Fall 2023",
        "images": [
            "iac_webpage.webp",
            "iac_metrics.webp",
            "iac_inventory.webp"
        ],
        "image_description": [
            "Dashboard showing the to-do list application",
            "Metrics dashboard for monitoring system health in Grafana",
            "Ansible configurations"
        ],
        "link": "https://github.com/tildeeine/iac_microservice_todolist"
    },
    {
        "title": "Solo hike 1 month from Trondheim to Oslo",
        "type": "personal",
        "description": "A month-long solo hike from Trondheim to Oslo, pushing my limits in planning, perseverance, and problem-solving.",
        "coverImage": "hike_smile.webp",
        "languages": [
            "Planning",
            "Persistence",
            "Problem solving"
        ],
        "task": "Planned and executed a solo hike, managed food and supplies, overcame physical and logistical challenges.",
        "solution": "I took on a month-long solo hike from Trondheim to Oslo right after my first year of studies. This adventure was all about pushing my limits, both physically and mentally.\n\nI started planning in October and set off as soon as summer break began in June. I spent months preparing, testing my gear, and training to carry a heavy backpack. I planned all my food in advance and sent it to myself as depots along the way. My backpack weighed between 15kg to 30kg, depending on access to water and how far it was between depots.  \n\nI handled everything from setting up camp daily to navigating with sometimes outdated maps. I faced challenges like Achilles tendonitis in the first week, a malfunctioning burner in the middle of the mountains the second week, and all sorts of weather. I learned to deal with unexpected issues creatively, and the experience boosted my skills in planning, persistence, and problem-solving.",
        "time": "Summer 2021",
        "images": [
            "hike_food.webp",
            "hike_eat.webp",
            "hike_tent.webp"
        ],
        "image_description": [
            "Pre-hike food and depot preparation",
            "Eating on the trail",
            "One of many tent setups and campsites"
        ],
        "link": "https://www.budstikka.no/tilde-20-reiser-hjem-fra-trondheim-til-fots/s/5-55-1085043"
    }
]